export const CATEGORIES = ["ワイン", "日本酒", "焼酎", "ジン", "ウイスキー", "その他"] as const;

export const WINE_TYPES = ["赤", "白", "ロゼ", "オレンジ", "スパークリング", "ノンアル"] as const;

export const WINE_COUNTRIES = [
  "フランス", "イタリア", "スペイン", "ドイツ", "オーストリア",
  "ポルトガル", "チェコ", "ハンガリー", "ジョージア", "ギリシャ", "スロヴェニア",
  "オーストラリア", "ニュージーランド", "南アフリカ", "アメリカ", "チリ",
  "日本", "その他"
] as const;

export const WINE_REGIONS: Record<string, string[]> = {
  "フランス": ["シャンパーニュ", "アルザス", "ロワール", "ノルマンディー・ブルターニュ", "ブルゴーニュ", "シャブリ", "ボジョレー", "コトー・デュ・リヨネ", "ボルドー", "シュッド・ウエスト", "コニャック", "ジュラ", "サヴォワ", "オーヴェルニュ", "プロヴァンス", "ローヌ", "ラングドック・ルーション", "その他"],
  "イタリア": ["ピエモンテ", "ヴァッレ・ダオスタ", "リグーリア", "ロンバルディア", "ヴェネト", "フリウリ＝ヴェネチア・ジューリア", "エミリア＝ロマーニャ", "トスカーナ", "マルケ", "ウンブリア", "アブルッツォ", "ラツィオ", "プーリア", "カンパーニア", "バジリカータ", "カラーブリア", "サルデーニャ", "シチリア", "その他"],
  "スペイン": ["その他"],
  "ドイツ": ["その他"],
  "オーストリア": ["その他"],
  "ポルトガル": ["その他"],
  "チェコ": ["その他"],
  "ハンガリー": ["その他"],
  "ジョージア": ["その他"],
  "ギリシャ": ["その他"],
  "スロヴェニア": ["その他"],
  "オーストラリア": ["その他"],
  "ニュージーランド": ["その他"],
  "南アフリカ": ["その他"],
  "アメリカ": ["その他"],
  "チリ": ["その他"],
  "日本": ["その他"],
  "その他": ["その他"],
};

// 日本酒生産量上位→五十音順
export const SAKE_PREFECTURES = [
  "新潟", "兵庫", "京都", "秋田", "山形", "福島", "長野", "栃木", "茨城", "埼玉",
  "愛知", "青森", "秋田", "石川", "岩手", "宮城", "山口", "広島", "岡山",
  "大阪", "神奈川", "千葉", "東京", "北海道", "静岡", "愛媛", "高知",
  "島根", "鳥取", "富山", "福井", "群馬", "栃木", "滋賀", "奈良", "和歌山",
  "三重", "岐阜", "山梨", "徳島", "香川", "宮崎", "大分", "熊本", "長崎",
  "佐賀", "福岡", "鹿児島", "沖縄", "その他"
] as const;

// 焼酎生産量上位→五十音順
export const SHOCHU_PREFECTURES = [
  "鹿児島", "宮崎", "熊本", "大分", "長崎", "沖縄",
  "愛知", "青森", "秋田", "石川", "岩手", "宮城", "山口", "広島", "岡山",
  "大阪", "神奈川", "千葉", "東京", "北海道", "静岡", "愛媛", "高知",
  "島根", "鳥取", "富山", "福井", "群馬", "栃木", "滋賀", "奈良", "和歌山",
  "三重", "岐阜", "山梨", "徳島", "香川", "新潟", "兵庫", "京都", "秋田",
  "山形", "福島", "長野", "茨城", "埼玉", "福岡", "佐賀", "その他"
] as const;

export const ALL_PREFECTURES = [
  "北海道", "青森", "岩手", "宮城", "秋田", "山形", "福島",
  "茨城", "栃木", "群馬", "埼玉", "千葉", "東京", "神奈川",
  "新潟", "富山", "石川", "福井", "山梨", "長野", "岐阜", "静岡", "愛知",
  "三重", "滋賀", "京都", "大阪", "兵庫", "奈良", "和歌山",
  "鳥取", "島根", "岡山", "広島", "山口",
  "徳島", "香川", "愛媛", "高知",
  "福岡", "佐賀", "長崎", "熊本", "大分", "宮崎", "鹿児島", "沖縄", "その他"
] as const;
